<?php
// echo = 10; // 代入
// echo $a = 10; // 代入出力〇
// echo $10; // 変数出力
// echo 1 0; // 半角空き
// echo １０; // 全角数字
// echo 1.0; // 小数点
// echo 1,0; // カンマ区切り〇
// echo '1'.'0'; // 文字列結合〇
// echo 1 + '0'; // 文字列加算
// echo '11' - '1'; // 文字列減算〇
// echo (10); // 丸括弧〇
// echo [10]; // ブラケット(配列値)
// echo {10}; // 波括弧(オブジェクト)
// echo {$a = 10}; // 代入波括弧
// echo $a == 10; // 等価演算子(左右の等価比較)
// echo $a += 10; // 複合演算子(上書き保存)〇
// $a = 10; echo '$a'; // 変数文字列
// $a = 10; echo($a); // 変数丸括弧〇
